package city.controller;

import java.util.ArrayList;
import java.util.List;

/**
 * cityName으로 입력받은 뒤 cityNum으로 바꿔야 할 때 사용
 * 사용예시) 
 * 		String cityName = req.getParameter("cityName");
		int cityNum = CityMapper.getCityNum(cityName);
		-> cityNum 변수 사용해서 db에 insert
 * @author nh
 *
 */
public class CityMapper {

	 private static final List<String> cityData = new ArrayList<>();

	    static {
	    	
	        // 도시 데이터 초기화
	        String[] cities = {
	        		"서울특별시", "인천광역시", "대전광역시", "대구광역시", "울산광역시", "부산광역시", "광주광역시"
		            , "세종특별자치시", "수원시", "용인시", "고양시", "성남시", "고양시", "화성시", "부천시", "남양주시"
		            , "안산시", "평택시", "안양시", "시흥시", "파주시", "김포시", "의정부시", "광주시", "하남시"
		            , "광명시", "군포시", "양주시", "오산시", "이천시", "안성시", "구리시", "의왕시", "포천시"
		            , "여주시", "동두천시", "과천시", "양평군", "가평군", "연천군", "춘천시", "원주시", "강릉시"
		            , "동해시", "태백시", "속초시", "삼척시", "홍천군", "횡성군", "영월군", "평창군", "정선군"
		            , "철원군", "화천군", "양구군", "인제군", "고성군", "양양군", "청주시", "충주시", "제천시"
		            , "보은군", "옥천군", "영동군", "증평군", "진천군", "괴산군", "음성군", "단양군", "천안시"
		            , "공주시", "보령시", "아산시", "서산시", "논산시", "계룡시", "당진시", "금산군", "부여군"
		            , "서천군", "청양군", "홍성군", "예산군", "태안군", "전주시", "익산시", "군산시", "정읍시"
		            , "남원시", "김제시", "무주군", "완주군", "부안군", "고창군", "임실군", "순창군", "진안군"
		            , "장수군", "목포시", "여수시", "순천시", "나주시", "광양시", "담양군", "곡성군", "구례군"
		            , "고흥군", "보성군", "화순군", "장흥군", "강진군", "해남군", "영암군", "무안군", "함평군"
		            , "영광군", "장성군", "완도군", "진도군", "신안군", "포항시", "경주시", "김천시", "안동시"
		            , "구미시", "영주시", "영천시", "상주시", "문경시", "경산시", "의성군", "청송군", "영양군"
		            , "영덕군", "청도군", "고령군", "성주군", "칠곡군", "예천군", "봉화군", "울진군", "울릉군"
		            , "창원시", "김해시", "양산시", "진주시", "거제시", "통영시", "사천시", "밀양시", "함안군"
		            , "거창군", "창녕군", "고성군", "하동군", "합천군", "남해군", "함양군", "산청군", "의령군"
		            , "제주시", "서귀포시"
	        };

	        for (String city : cities) {
	            cityData.add(city);
	        }
	    }

	    public static int getCityNum(String cityName) {
	        int index = cityData.indexOf(cityName);
	        // indexOf가 찾지 못한 경우 -1을 반환하므로, 기본값으로 0을 반환하거나 원하는 값을 반환
	        return (index != -1) ? index + 1 : 0;
	    }
}
